Ran Plan for project: `sharedservices-prod` dir: `accounts/sharedservices-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_dashboard.step_functions_dashboard will be updated in-place
~ resource "aws_cloudwatch_dashboard" "step_functions_dashboard" {
      ~ dashboard_body = jsonencode(
            {
              - widgets = [
                  - {
                      - height     = 6
                      - properties = {
                          - metrics = [
                              - [
                                  - "AWS/States",
                                  - "ExecutionsStarted",
                                  - "StateMachineArn",
                                  - "arn:aws:states:us-east-2:825765422855:stateMachine:manual_workflow",
                                ],
                              - [
                                  - ".",
                                  - "ExecutionsSucceeded",
                                  - ".",
                                  - ".",
                                ],
                              - [
                                  - ".",
                                  - "ExecutionsFailed",
                                  - ".",
                                  - ".",
                                ],
                            ]
                          - period  = 300
                          - region  = "us-east-2"
                          - stat    = "Sum"
                          - title   = "Step Function Executions"
                        }
                      - type       = "metric"
                      - width      = 12
                      - x          = 0
                      - y          = 0
                    },
                  - {
                      - height     = 6
                      - properties = {
                          - alarms = [
                              - "arn:aws:cloudwatch:us-east-2:825765422855:alarm:sharedservices-manual-workflow-failures",
                            ]
                          - title  = "Step Function Alarms"
                        }
                      - type       = "alarm"
                      - width      = 12
                      - x          = 12
                      - y          = 0
                    },
                ]
            }
        ) -> (known after apply)
        id             = "StepFunctionsDashboard"
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.manual_workflow_failures will be updated in-place
~ resource "aws_cloudwatch_metric_alarm" "manual_workflow_failures" {
      ~ dimensions                            = {
          - "StateMachineArn" = "arn:aws:states:us-east-2:825765422855:stateMachine:manual_workflow"
        } -> (known after apply)
        id                                    = "sharedservices-manual-workflow-failures"
        tags                                  = {}
        # (21 unchanged attributes hidden)
    }

  # aws_iam_role_policy.lambda_sfn_execution will be updated in-place
~ resource "aws_iam_role_policy" "lambda_sfn_execution" {
        id          = "sharedservices_lambda_role:AllowStatesStartExecution"
        name        = "AllowStatesStartExecution"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "states:StartExecution",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:states:us-east-2:825765422855:stateMachine:manual_workflow",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_lambda_function.start_sfn will be updated in-place
~ resource "aws_lambda_function" "start_sfn" {
        id                             = "start_sfn"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "STATE_MACHINE_ARN" = "arn:aws:states:us-east-2:825765422855:stateMachine:manual_workflow"
            } -> (known after apply)
        }

        # (4 unchanged blocks hidden)
    }

  # aws_sfn_state_machine.manual_workflow must be replaced
-/+ resource "aws_sfn_state_machine" "manual_workflow" {
      ~ arn                       = "arn:aws:states:us-east-2:825765422855:stateMachine:manual_workflow" -> (known after apply)
      ~ creation_date             = "2025-03-20T19:21:07Z" -> (known after apply)
      + description               = (known after apply)
      ~ id                        = "arn:aws:states:us-east-2:825765422855:stateMachine:manual_workflow" -> (known after apply)
        name                      = "manual_workflow"
      + name_prefix               = (known after apply)
      + revision_id               = (known after apply)
      + state_machine_version_arn = (known after apply)
      ~ status                    = "ACTIVE" -> (known after apply)
      - tags                      = {} -> null
      ~ type                      = "EXPRESS" -> "STANDARD" # forces replacement
      + version_description       = (known after apply)
        # (4 unchanged attributes hidden)

      ~ encryption_configuration (known after apply)
      - encryption_configuration {
          - kms_data_key_reuse_period_seconds = 0 -> null
          - type                              = "AWS_OWNED_KEY" -> null
            # (1 unchanged attribute hidden)
        }

      ~ tracing_configuration (known after apply)
      - tracing_configuration {
          - enabled = false -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 4 to change, 1 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p sharedservices-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fsharedservices-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p sharedservices-prod
  ```
Plan: 1 to add, 4 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```